{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_2", "input_dtype": "float32", "cropping": [[70, 25], [0, 0]], "batch_input_shape": [null, 160, 320, 3], "trainable": true}}, {"class_name": "Lambda", "config": {"output_shape": null, "name": "lambda_3", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\"\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0002\u0000d\u0003\u0000\u0083\u0003\u0000S)\u0004N\u00e9\u0000\u0000\u0000\u0000\u00e9(\u0000\u0000\u0000\u00e9\u00a0\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-6b10e7899b08>\u00da\fresize_comma\u0001\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "trainable": true}}, {"class_name": "Lambda", "config": {"output_shape": null, "name": "lambda_4", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-92a946050f1d>\u00da\b<lambda>\u000e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 8, "nb_row": 8, "name": "convolution2d_4", "border_mode": "same", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 16, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "subsample": [4, 4], "dim_ordering": "tf", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "name": "convolution2d_5", "border_mode": "same", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 32, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_row": 5, "name": "convolution2d_6", "border_mode": "same", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 512, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 50, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 1, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true}}], "keras_version": "1.1.2"}