{  
  "class_name":"Sequential",
  "keras_version":"1.1.1",
  "config":[  
    {  
      "class_name":"Convolution2D",
      "config":{  
        "batch_input_shape":[  
          null,
          160,
          320,
          3
        ],
        "W_regularizer":null,
        "activity_regularizer":null,
        "border_mode":"same",
        "activation":"linear",
        "b_constraint":null,
        "nb_row":3,
        "subsample":[  
          1,
          1
        ],
        "init":"glorot_uniform",
        "name":"convolution2d_1",
        "input_dtype":"float32",
        "trainable":true,
        "dim_ordering":"tf",
        "bias":true,
        "b_regularizer":null,
        "nb_col":3,
        "W_constraint":null,
        "nb_filter":160
      }
    },
    {  
      "class_name":"Activation",
      "config":{  
        "trainable":true,
        "name":"activation_1",
        "activation":"relu"
      }
    },
    {  
      "class_name":"Convolution2D",
      "config":{  
        "W_regularizer":null,
        "activity_regularizer":null,
        "border_mode":"valid",
        "activation":"linear",
        "b_constraint":null,
        "nb_row":3,
        "subsample":[  
          1,
          1
        ],
        "init":"glorot_uniform",
        "name":"convolution2d_2",
        "trainable":true,
        "dim_ordering":"tf",
        "bias":true,
        "b_regularizer":null,
        "nb_col":3,
        "W_constraint":null,
        "nb_filter":32
      }
    },
    {  
      "class_name":"Activation",
      "config":{  
        "trainable":true,
        "name":"activation_2",
        "activation":"relu"
      }
    },
    {  
      "class_name":"MaxPooling2D",
      "config":{  
        "dim_ordering":"tf",
        "border_mode":"valid",
        "strides":[  
          2,
          2
        ],
        "trainable":true,
        "name":"maxpooling2d_1",
        "pool_size":[  
          2,
          2
        ]
      }
    },
    {  
      "class_name":"Dropout",
      "config":{  
        "trainable":true,
        "name":"dropout_1",
        "p":0.25
      }
    },
    {  
      "class_name":"Convolution2D",
      "config":{  
        "W_regularizer":null,
        "activity_regularizer":null,
        "border_mode":"same",
        "activation":"linear",
        "b_constraint":null,
        "nb_row":3,
        "subsample":[  
          1,
          1
        ],
        "init":"glorot_uniform",
        "name":"convolution2d_3",
        "trainable":true,
        "dim_ordering":"tf",
        "bias":true,
        "b_regularizer":null,
        "nb_col":3,
        "W_constraint":null,
        "nb_filter":64
      }
    },
    {  
      "class_name":"Activation",
      "config":{  
        "trainable":true,
        "name":"activation_3",
        "activation":"relu"
      }
    },
    {  
      "class_name":"Convolution2D",
      "config":{  
        "W_regularizer":null,
        "activity_regularizer":null,
        "border_mode":"valid",
        "activation":"linear",
        "b_constraint":null,
        "nb_row":3,
        "subsample":[  
          1,
          1
        ],
        "init":"glorot_uniform",
        "name":"convolution2d_4",
        "trainable":true,
        "dim_ordering":"tf",
        "bias":true,
        "b_regularizer":null,
        "nb_col":3,
        "W_constraint":null,
        "nb_filter":64
      }
    },
    {  
      "class_name":"Activation",
      "config":{  
        "trainable":true,
        "name":"activation_4",
        "activation":"relu"
      }
    },
    {  
      "class_name":"MaxPooling2D",
      "config":{  
        "dim_ordering":"tf",
        "border_mode":"valid",
        "strides":[  
          2,
          2
        ],
        "trainable":true,
        "name":"maxpooling2d_2",
        "pool_size":[  
          2,
          2
        ]
      }
    },
    {  
      "class_name":"Dropout",
      "config":{  
        "trainable":true,
        "name":"dropout_2",
        "p":0.25
      }
    },
    {  
      "class_name":"Flatten",
      "config":{  
        "trainable":true,
        "name":"flatten_1"
      }
    },
    {  
      "class_name":"Dense",
      "config":{  
        "W_regularizer":null,
        "input_dim":null,
        "activation":"linear",
        "b_constraint":null,
        "activity_regularizer":null,
        "init":"glorot_uniform",
        "name":"dense_1",
        "trainable":true,
        "bias":true,
        "b_regularizer":null,
        "W_constraint":null,
        "output_dim":512
      }
    },
    {  
      "class_name":"Activation",
      "config":{  
        "trainable":true,
        "name":"activation_5",
        "activation":"relu"
      }
    },
    {  
      "class_name":"Dropout",
      "config":{  
        "trainable":true,
        "name":"dropout_3",
        "p":0.5
      }
    },
    {  
      "class_name":"Dense",
      "config":{  
        "W_regularizer":null,
        "input_dim":null,
        "activation":"linear",
        "b_constraint":null,
        "activity_regularizer":null,
        "init":"glorot_uniform",
        "name":"dense_2",
        "trainable":true,
        "bias":true,
        "b_regularizer":null,
        "W_constraint":null,
        "output_dim":1
      }
    }
  ]
}