{"config": [{"config": {"nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "input_dtype": "float32", "b_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "nb_col": 3, "b_constraint": null, "nb_filter": 160, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "activation": "linear", "trainable": true, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 32, "name": "convolution2d_2", "activation": "linear", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 64, "name": "convolution2d_3", "activation": "linear", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 64, "name": "convolution2d_4", "activation": "linear", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 512, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "activation": "linear", "trainable": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "activation": "linear", "trainable": true, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}