{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 3, "nb_filter": 160, "name": "convolution2d_1", "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 160, 320, 3], "subsample": [1, 1], "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_row": 3, "nb_filter": 32, "name": "convolution2d_2", "subsample": [1, 1], "b_constraint": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 3, "nb_filter": 64, "name": "convolution2d_3", "subsample": [1, 1], "b_constraint": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "nb_row": 3, "nb_filter": 64, "name": "convolution2d_4", "subsample": [1, 1], "b_constraint": null, "bias": true, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "output_dim": 512, "trainable": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "output_dim": 1, "trainable": true, "W_constraint": null}}], "keras_version": "1.1.2"}